# IsAnalysisForClosedLoopHydronicPipingNetworksEnabled Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeSettings..::..IsAnalysisForClosedLoopHydronicPipingNetworksEnabled Method
PipeSettings Class See Also
---
Indicates whether analysis for closed loop hydronic piping networks is enabled in the specified document.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static bool IsAnalysisForClosedLoopHydronicPipingNetworksEnabled(
	Document ccda
)
```

Visual Basic
---
```text
Public Shared Function IsAnalysisForClosedLoopHydronicPipingNetworksEnabled ( _
	ccda As Document _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsAnalysisForClosedLoopHydronicPipingNetworksEnabled(
	Document^ ccda
)
```

# ### Parameters
ccda
    Type: Autodesk.Revit.DB..::..Document The document.
# ### Return Value
Returns true if analysis for closed loop hydronic piping networks is enabled, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace